---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.TargetRebarConstraintType.Edge
enum: Autodesk.Revit.DB.Structure.TargetRebarConstraintType
source: html/b5eb20bf-e887-41b4-f15c-0c1860799a8b.htm
---
# Autodesk.Revit.DB.Structure.TargetRebarConstraintType.Edge

Handle is constrained to location of a single edge segment of the other Rebar.
 Drives the edge in the direction perpendicular to the edge and
 in the Rebar's primary plane.